app/controllers/register_controller.rb

INSERT INTO `registers` (`nome`, `email`, `created_at`, `updated_at`) VALUES ('derik', 'derik', '2018-06-05 03:43:02', '2018-06-05 03:43:02')
---
  def create
    @register = Register.new(register_params)
      respond_to do |format|
        if @register.save